In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
from sklearn.model_selection import train_test_split
import sklearn.preprocessing as pre

import warnings
warnings.filterwarnings("ignore")

import wrangle as w

In [2]:
zillow = w.aquire_zillow_data()

In [4]:
zillow.shape

(52441, 6)

In [5]:
zillow.head()

   bathrooms  bedrooms  home_value  square_feet  year_built    fips
0        3.5       4.0   1023282.0       3100.0      1998.0  6059.0
1        1.0       2.0    464000.0       1465.0      1967.0  6111.0
2        2.0       3.0    564778.0       1243.0      1962.0  6059.0
3        3.0       4.0    145143.0       2376.0      1970.0  6037.0
4        3.0       4.0    773303.0       2962.0      1950.0  6037.0

In [6]:
zillow.info(show_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52441 entries, 0 to 52440
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   bathrooms    52441 non-null  float64
 1   bedrooms     52441 non-null  float64
 2   home_value   52440 non-null  float64
 3   square_feet  52359 non-null  float64
 4   year_built   52325 non-null  float64
 5   fips         52441 non-null  float64
dtypes: float64(6)
memory usage: 2.4 MB

In [7]:
zillow[(zillow['year_built'].isnull()) | (zillow['square_feet'].isnull())]

       bathrooms  bedrooms  home_value  square_feet  year_built    fips
124          0.0       0.0    830145.0          NaN         NaN  6059.0
715          1.0       2.0    136296.0        994.0         NaN  6037.0
2612         0.0       0.0    168828.0       1378.0         NaN  6037.0
2613         0.0       0.0    168828.0       1378.0         NaN  6037.0
3322         0.0       0.0    643406.0          NaN         NaN  6059.0
...          ...       ...         ...          ...         ...     ...
48597        0.0       0.0    327761.0          NaN         NaN  6059.0
49690        0.0       0.0    321981.0          NaN         NaN  6059.0
50078        0.0       0.0    468439.0          NaN         NaN  6111.0
50357        2.0       4.0    493355.0       2320.0         NaN  6111.0
52429        0.0       0.0     34124.0        892.0         NaN  6037.0

[121 rows x 6 columns]

In [8]:
zillow_clean1 = zillow[(zillow['bathrooms'] > 0 ) & (zillow['bedrooms'] > 0)]

In [9]:
zillow_clean1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52288 entries, 0 to 52440
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   bathrooms    52288 non-null  float64
 1   bedrooms     52288 non-null  float64
 2   home_value   52287 non-null  float64
 3   square_feet  52280 non-null  float64
 4   year_built   52248 non-null  float64
 5   fips         52288 non-null  float64
dtypes: float64(6)
memory usage: 2.8 MB

In [15]:
zillow_clean1.head()

   bathrooms  bedrooms  home_value  square_feet  year_built    fips
0        3.5       4.0   1023282.0       3100.0      1998.0  6059.0
1        1.0       2.0    464000.0       1465.0      1967.0  6111.0
2        2.0       3.0    564778.0       1243.0      1962.0  6059.0
3        3.0       4.0    145143.0       2376.0      1970.0  6037.0
4        3.0       4.0    773303.0       2962.0      1950.0  6037.0

In [3]:
clean_zillow = w.clean_zillow(zillow)

In [4]:
clean_zillow.head()

,bathrooms,bedrooms,home_value,square_feet,year_built,bath_bed_ratio,county,county_Orange,county_Ventura
0,3.5,4,1023282.0,3100,1998,0.875000,Orange,1,0
1,1.0,2,464000.0,1465,1967,0.500000,Ventura,0,1
2,2.0,3,564778.0,1243,1962,0.666667,Orange,1,0
3,3.0,4,145143.0,2376,1970,0.750000,LA,0,0
4,3.0,4,773303.0,2962,1950,0.750000,LA,0,0

In [5]:
clean_zillow.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52246 entries, 0 to 52440
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   bathrooms       52246 non-null  float64
 1   bedrooms        52246 non-null  int64
 2   home_value      52246 non-null  float64
 3   square_feet     52246 non-null  int64
 4   year_built      52246 non-null  int64
 5   bath_bed_ratio  52246 non-null  float64
 6   county          52246 non-null  object
 7   county_Orange   52246 non-null  uint8
 8   county_Ventura  52246 non-null  uint8
dtypes: float64(3), int64(3), object(1), uint8(2)
memory usage: 3.3+ MB

In [2]:
mydf, X_train_exp, X_train, y_train, X_validate, y_validate, X_test, y_test = w.big_zillow_wrangle('home_value')

In [3]:
mydf.head()

,bathrooms,bedrooms,home_value,square_feet,year_built,county,county_Orange,county_Ventura
0,3.5,4,1023282.0,3100,1998,Orange,1,0
1,1.0,2,464000.0,1465,1967,Ventura,0,1
2,2.0,3,564778.0,1243,1962,Orange,1,0
3,3.0,4,145143.0,2376,1970,LA,0,0
4,3.0,4,773303.0,2962,1950,LA,0,0

In [4]:
X_train.shape, y_train.shape

((33959, 6), (33959,))